{"id":14881220,"mediaExerciseId":"e07a56bf-2dd6-4cd5-bfbc-fb6b78341678","exerciseName":"2","chapterName":"10","chapterTitle":"Making Capital Investment Decisions","groupId":null,"groupTitle":null,"isPremium":true,"sectionName":"10.2","sectionTitle":"Incremental Cash Flows","pageNumber":316,"solutions":[{"id":6320301,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"In the following exercise, we must explain some basic concepts related to incremental cash flows and project evaluation.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":1},{"columns":[{"text":"###  Part 10.2a\n\nFor this part of the exercise, we'll briefly explain the concepts of **sunk costs** and **opportunity costs**.\n\n- Sunk costs refer to those costs we have already paid or have incurred in the liability to pay. We cannot decide on sunk costs at present; they either must take place or have already taken place, irrespective of the project evaluation.\n\n- Opportunity costs are incurred when giving up the most valuable alternative for preferring an option that is assumed to generate a higher benefit or profitability.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"### Part 10.2b\n\nNext, we will ll discuss the concept of **erosion**.\n\nWe can define erosion as the negative impact on the cash flows of an existing project due to the launch of a new one.\n\nErosion will only be relevant for project evaluation if the negative impact on the existing project's cash flows occurs as a direct result of the launch of the new project and would not occur anyway, given other outside factors, such as competition.\n\nIf erosion is determined to be a relevant factor, then the impact on the existing project's cash flows must be accounted for in the cash flows of the new project.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3},{"columns":[{"text":"### Part 10.2c\n\nFinally, we will analyze the relevance of interest paid in the context of project evaluation.\n\nThe interest paid is not relevant to evaluating a project because investors are concerned about the cash flows that the assets of that project will generate and how they compare to the project's cost of acquisition. \n\nThe initial cost and future cash flows are necessary to calculate the project's Net Present Value (NPV), determining the project's degree of profitability (or unprofitability).\n\nTherefore, we must separately analyze the interest paid by any debt incurred to finance the project and how to divide the future cash flows between owners and creditors consequently.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4}],"rating":0,"solutionUuid":"35f2e5f8-dfb9-41e4-9ba3-562b67febb44","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":4},{"id":6258135,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"In this problem, we will define the important terms that will be used for this section. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":1},{"columns":[{"text":"**a.** In evaluating the costs when making a decision, there are costs that are considered while there are costs that are no longer relevant.\n\n**Sunk costs** are costs that are no longer relevant in decision making as these were incurred in the past. The only reason that these are examined is to give a background on the past expenses of the company. \n\nOn the other hand, **opportunity costs** refer to the inevitable downside when making a decision. When choosing between two options, one will always be omitted. The opportunity cost refers to the value of this choice that is omitted. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"**b.** Erosion refers to any form of negative impact that affects the company's financial status. These impacts may be in the form of losses, additional costs, or other factors that bring in negative cashflow. \n\nIt is important to assess erosion since this affects the company's cashflow and it is necessary to evaluate whether its effects are drastic or it can still be mitigated. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3},{"columns":[{"text":"**c.** As mentioned in **a.** costs incurred in the past are no longer relevant in decision making. Interest paid is considered as a sunk cost since it is already counted in the capital cost. In this case, the capital cost refers to the amount invested from the previous year or period. \n\nMoreover, the cash from the interest paid does not go directly towards any part of the project since these are paid to either the bank or the investor which makes it an irrelevant factor in financial decision making for the project. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4}],"rating":0,"solutionUuid":"6e4dffea-6371-46c3-b1c3-f8ab8655715b","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":4},{"id":6370540,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"**10.2a**  In this part of the question, we are asked to define the sunk cost and the opportunity cost.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":1},{"columns":[{"text":"Expenses that have previously been paid but are not eligible for reimbursement are known as **sunk costs**. The expense of not choosing the next best alternative is known as an **opportunity cost**. These are non-refundable expenses. Opportunity costs are the expenses of not taking a specific action or picking a less profitable business option. Opportunity costs must be addressed when balancing prospective benefits with potential expenses. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"**10.2b**  The question asks us to describe what the relationship between erosion and corporate governance is and why it is significant.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3},{"columns":[{"text":"**Erosion** is the process of anything gradually deteriorating over time, usually through physical or chemical means. In the context of corporate governance, erosion refers to a company's value gradually dwindling due to a lack of innovation or a failing to meet investor expectations. Erosion can be a major concern for shareholders, as it can lead to a decline in the value of their shares. By monitoring erosion , corporate directors can ensure that the company is making progress toward meeting investor expectations and staying competitive.  Additionally, Directors should take steps to prevent erosion from happening in the first place by implementing policies and procedures that support innovation and growth. Overall, corporate governance is a critical component of maintaining the value of a company. by understanding erosion and implementing effective policies and procedures, directors can help protect shareholder value. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4},{"columns":[{"text":"**10.2c** If the cash flow is unimportant, the question asks us to explain the relationship between project evaluation and interest paid.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":5},{"columns":[{"text":"**Interest paid** is an irrelevant cash flow for project evaluation because it has nothing to do with the cash flows of the project being evaluated. Rather than the project's company, interest is paid to lenders. As a result, the interest rate paid has no influence on the profitability or losses of the project.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":6}],"rating":0,"solutionUuid":"de4cbbec-84a9-4c34-8f96-5b63e840a6ad","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":6}],"textbook":{"authors":"Bradford D. Jordan, Randolph W. Westerfield, Stephen A. Ross","imageUrl":"https://d2nchlq0f2u6vy.cloudfront.net/textbook_covers/tmpm0p82b7h","imageThumbnailUrl":"https://d2nchlq0f2u6vy.cloudfront.net/cache/d1/d3/d1d34d106dd29dd2e71be582412ef59d.jpg","id":34320,"isbn":"9781259918957","isPremium":true,"title":"Fundamentals of Corporate Finance","edition":"12th Edition","verifiedSolutionCount":1217,"shouldBeIndexableForSeo":true,"modified":1665448474394,"active":true,"publisher":"McGraw-Hill Education","mainTextbookIsbn":null,"subjects":{"level1":["Social Science"],"level2":["Economics"],"level3":["Finance"]}},"nextExercises":[{"id":14881221,"exerciseName":"3","page":319,"hasSolution":true,"mediaExerciseId":"bc8331ae-d7d9-494f-ba8c-1707963ab727","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-10-exercises-3-bc8331ae-d7d9-494f-ba8c-1707963ab727"}],"previousExercises":[{"id":14881219,"exerciseName":"1","page":314,"hasSolution":true,"mediaExerciseId":"e80eb35c-c634-4bcd-abe0-bdfa926f79d6","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-10-exercises-1-e80eb35c-c634-4bcd-abe0-bdfa926f79d6"}],"_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-10-exercises-2-e07a56bf-2dd6-4cd5-bfbc-fb6b78341678"}