{"id":14880831,"mediaExerciseId":"3da3081f-855f-46c9-89dd-645b7a01ca52","exerciseName":"1","chapterName":"4","chapterTitle":"Long-Term Financial Planning and Growth","groupId":null,"groupTitle":null,"isPremium":true,"sectionName":"4.1","sectionTitle":"What Is Financial Planning?","pageNumber":95,"solutions":[{"id":5920271,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"In this exercise, we are to determine the (a) two dimensions of the planning process and (b) the reasons why firms draw up financial plans.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":1},{"columns":[{"text":"## Financial Planning\n\\\nFinancial planning is referred to as the systematic method of the attainment of the company's financial goals. It indicates the actions and decisions to be done in the future for the company.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"## Growth of a Company (A Financial Management Goal)\n\\\nThe goal of a company is to increase profit, increasing the equity of the company and its shareholders. Growth pertains to the development of a firm and its shareholders financially, economically, and within the industry.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3},{"columns":[{"text":"## Required (a)\n\\\nNow, let us determine the dimensions of financial planning. \n\\\nThe dimensions of financial planning are as follows:\n&nbsp;\n* Planning Horizon; and\n&nbsp;\n* Aggregation\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4},{"columns":[{"text":"## Planning Horizon\n\\\nThe first dimension of financial planning is the establishment of the planning horizon. The planning horizon is referred to as the time period to which a financial plan takes place. \n\\\nA financial plan may be for a short-term or a long-term goal. A short-term run may last for 12 months or less while a long-term run may be taken from two to three years.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":5},{"columns":[{"text":"## Aggregation\n\\\nThe total investment and projects included in the financial plan are determined to acquire the necessary capital to render the plans of the company. In line with this, the sum of the investment proposals of each individual unit of operation is determined and is referred to as the aggregation, which is the second dimension of financial planning that is to be established.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":6},{"columns":[{"text":"After the establishment of the dimensions of financial planning- **Planning Horizon and Aggregation**- the company prepares alternative assumptions as inputs regarding the variables that significantly affect the financial plan. The alternative assumptions usually involve the *Worst Case, Normal Case, and Best Case* assumptions, considering all possible outcomes to determine the best type of plan necessary for a company.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":7},{"columns":[{"text":"## Required (b)\n\\\nNow, let us determine the reasons why companies prepare financial plans.\n\\\nAfter the establishment of the possible outcomes that will be the basis of a financial plan, the determined plan for the company will be pushed through that will benefit the company in certain ways. Among the reasons for the preparation of financial plans are discussed in the succeeding steps.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":8},{"columns":[{"text":"**The preparation of a financial plan is necessary for a company with numerous investment proposals and projects for various operating functions of the company.** \n\\\nWith this, the financing options of these proposals are determined. The financial plan determines the method of acquisition of the capital that will be used to finance the proposals and projects and on what financing structure is to be acquired.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":9},{"columns":[{"text":"**Financial planning is necessary for the investment and financing options considered by a company and the overall development of the company's initiatives affecting its shareholders.** \n\\\nThe financial plan details the questions to be asked with regards to the actions and decisions of the firm such as concerns with regards to the marketing of the products, introduction of new products and services to the market, and the evaluation of the fixed assets of the company.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":10},{"columns":[{"text":"**Another purpose of a financial plan is to develop contingency plans for the company to avoid any unnecessary drawbacks and to minimize the effects of unpredictable circumstances that may affect the operations of the firm.** \n\\\nFinancial planning may aid in the identification of events that may arise in the future that the company could address in terms of the actions and decisions to be made.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":11},{"columns":[{"text":"**Lastly, financial planning aids in maintaining consistency in the achievement of company goals and objectives, by imposing a consolidated structure for the reconciliation of these goals.** \n\\\nFinancial planning ensures that the company goals and objectives are attainable and consistent with each other despite the specificity of these goals in terms of their areas of focus. Prioritization of the accomplishment of goals are done to avoid conflict.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":12}],"rating":5,"solutionUuid":"bf6d4f32-7e41-4341-82b0-fccacad75c3f","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":12},{"id":6326804,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"In this exercise, we are asked to identify two components of the financial planning process as well as to explain why companies should create financial plans.\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":1},{"columns":[{"text":"a) There are two dimensions to financial planning:\n\n1. **Planning Horizon:** This is the initial component of the planning process that must be formed, and it represents a long-term period during which financial planners focus on financial planning, which is usually considered to last two to five years.\n2. **Aggregation:** When creating a financial plan, all individual projects and investments of the company are added together to estimate the total amount of money needed to be invested. In fact, each operational unit's minor investment requests are put together and considered as one large project.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"b) Companies should create financial plans because they help in the following ways:\n\n**Examining Interactions:** Investment plans for the firm's various operational operations and available financing options may be clearly linked to a financial plan. To put it another way, if the company wants to develop and make new investments and initiatives, how will it fund this?\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3},{"columns":[{"text":"**Exploring Options:**  Many alternative scenarios may be developed and compared in a consistent manner thanks to the financial plan. Numerous investment and financing options might be considered, as well as their influence on the firm's shareholders.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4},{"columns":[{"text":"**Avoiding Surprises:** One of the goals of financial planning is to foresee potential problems and prepare for them. A key aspect of this plan should include a discussion of what the company will do if things go wrong or, more broadly, if current assumptions about the future are gravely incorrect.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":5},{"columns":[{"text":"**Ensuring Feasibility and Internal Consistency:** In addition to the general goal of value creation, companies will often have a number of specific goals such as market share, return on capital, and financial leverage. It's not always easy to identify the connections between a company's many objectives and different areas of its operations. A financial plan makes these connections clear and ensures that the objectives and plans established for various sections of a business are both attainable and internally consistent. To create a cohesive strategy, goals and objectives must be adjusted and priority created.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":6},{"columns":[{"text":"A **major** benefit of the planning process is that it compels managers to think about objectives and prioritize them. Although traditional business knowledge maintains that financial plans are ineffective, research has shown them to be successful when done properly.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":7}],"rating":0,"solutionUuid":"3397948e-fa91-4da3-81d3-0be3839ec1ff","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":7}],"textbook":{"authors":"Bradford D. Jordan, Randolph W. Westerfield, Stephen A. Ross","imageUrl":"https://d2nchlq0f2u6vy.cloudfront.net/textbook_covers/tmpm0p82b7h","imageThumbnailUrl":"https://d2nchlq0f2u6vy.cloudfront.net/cache/d1/d3/d1d34d106dd29dd2e71be582412ef59d.jpg","id":34320,"isbn":"9781259918957","isPremium":true,"title":"Fundamentals of Corporate Finance","edition":"12th Edition","verifiedSolutionCount":1217,"shouldBeIndexableForSeo":true,"modified":1665448474394,"active":true,"publisher":"McGraw-Hill Education","mainTextbookIsbn":null,"subjects":{"level1":["Social Science"],"level2":["Economics"],"level3":["Finance"]}},"nextExercises":[{"id":14880832,"exerciseName":"2","page":98,"hasSolution":true,"mediaExerciseId":"7bce67fd-fd1f-43bd-ad05-681a0eecc629","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-4-exercises-2-7bce67fd-fd1f-43bd-ad05-681a0eecc629"}],"previousExercises":[{"id":14880829,"exerciseName":"3","page":90,"hasSolution":true,"mediaExerciseId":"e9de4367-81d7-425d-a3fa-e3eae5a03331","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-4-exercises-3-e9de4367-81d7-425d-a3fa-e3eae5a03331"},{"id":14880828,"exerciseName":"2","page":90,"hasSolution":true,"mediaExerciseId":"831bbe0a-d384-42c2-899b-87bcea36e3d8","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-4-exercises-2-831bbe0a-d384-42c2-899b-87bcea36e3d8"}],"_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-4-exercises-1-3da3081f-855f-46c9-89dd-645b7a01ca52"}