{"id":14881172,"mediaExerciseId":"27e36e1e-319a-4c3a-9866-ff48f9552769","exerciseName":"1","chapterName":"9","chapterTitle":"Net Present Value and Other Investment Criteria","groupId":612331,"groupTitle":"Critical Thinking Questions","isPremium":true,"sectionName":null,"sectionTitle":null,"pageNumber":303,"solutions":[{"id":6372093,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"**1.**  For this item, we are asked to identify how would the project have a payback in less than expected life. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":1},{"columns":[{"text":"The accounting rate of return will indeed result in a lower than the project’s long term cash flow greater than zero, furthermore, still, the net present value may be zero, positive, negative, or even slightly lesser on how much the discount rate is less than equal to, or greater than IRR. Suppose that conventional cash flows, a present value shorter than the project’s longevity, appears to indicate the net present value is positive for a zero rate of discount return. Although no more definitive could have been said. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"If the discounted payback period is lesser than any project’s lifespan it should be directly rejected with negative NPV. The NPV is primarily that counts as equal increasing or decreasing in firm wealth due to the project after accounting for the valuable time of cash.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3},{"columns":[{"text":"**2.** This question requires us to identify what its payback would be when it affects the project with conventional cash flows and positive net present value.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4},{"columns":[{"text":"Presume that the payback period will be more limited than the life of the project. One project must be considered more than the supplementary and lastly, the IRR would be bigger than the recovery ratio. This is frequently labeled  DISCOUNTED CASH FLOW ( DCF) valuation.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":5},{"columns":[{"text":"**3a.** The period wherein the customary cost will be reimbursed before is formulated as the term in which the cash flows will recognize the expenditure of the project. Determine that it furnishes substantial data deeming the period after which the project will be beneficial or the duration at which it will surpass breakeven. To estimate the payback period you can manipulate the mathematical formula of payback period = initial investment/ cash flow per year. Besides, there is the criterion decision rule wherein a project should barely be approved if the preliminary investment is recouped within a distinct duration  ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":6},{"columns":[{"text":"**3.b** Cash flows reported received throughout the initial cycle of the project are found to be more significant than investment returns started receiving later in the process. A daunting dispute with the comeuppance tactic is that it does not take into account the duration profitability.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":7},{"columns":[{"text":"**3.c** The major benefit of the amortization rule is that everything is predicated on cash flows instead of just profitability. It is also conveniently selectable and intelligible.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":8},{"columns":[{"text":"**4.** The items below will help us understand the benefits and drawbacks of the discounted payback rule. Clearly, it is stated below each letter.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":9},{"columns":[{"text":"**4.a** The **discounted payback perio**d is the duration of length in which the currency flows from an involvement payback the introductory investment, factoring in the momentum price of the currency. It is especially utilized to enumerate the projected retrieval from a recommended equity investment alternative. The discounted payback period is added up by deducting the net cash flows of every interval and cumulating the discounted cash flows until the proportion of the preliminary investment is convened.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":10},{"columns":[{"text":"**4.5b.** It cannot confide a corporate executive or investor how the bargain will execute subsequently and how greatly significantly it will expand in aggregate. It may dominate to conclusions that hinder the NPV estimation. Thus, Ignores the term usefulness of cash, imposes an incidental cutoff threshold, avoids cash flows beyond the cutoff duration, favored long-term projects, such as analysis and improvement, and fresh projects.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":11},{"columns":[{"text":"**4.c** The discounted payback period formula demonstrates how long it will take to recoup an investment established on discerning the existing value of the project's projected cash flows. So it is mainly more precise than the definitive payback period computation, because the discounted payback period segments in the duration value of money.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":12},{"columns":[{"text":"**5.**  For this item, we are going to give some starting information on what to focus on while exploring various resources. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":13},{"columns":[{"text":"**5.a** The ruling benchmarks contemplating the Average accounting return (AAR) is to ratify projects which retain AAR in the residue of the business agreed on or the benchmark AAR. AAR should be rejected. Intermediate reckoning retrieval is a bargain’s typical accounting rate of return over an endeavor, over a length of period. It is perhaps enumerated by distributing the typical net earnings of the property by its usual list price, subtracted over the property or the project duration.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":14},{"columns":[{"text":"**5.b.** To an economic supervisor, both the dependence on accounting abundances of somewhat pertinent demand data and the exclusion of the duration significance of capital deliberations are discomforting. Despite these crises, AAR proceeds with being operated in trade because (1) the estimation evidence is usually accessible, (2) pundits frequently aim at accounting probabilities to examine substantial accomplishment, and (3) executive reimbursement is continuously wrapped to the reward of particular mark accounting rate objectives.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":15},{"columns":[{"text":"AAR is not a gauge of cash flows and demand cost, but an extent of monetary affidavit accounts that always suffer slight pretense to the applicable price of an undertaking. In proliferation, the preference for a cutoff is incidental, and the time value of money is resisted. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":16}],"rating":0,"solutionUuid":"50325437-f665-46eb-ac01-1685ecead2ea","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":16},{"id":6055598,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"When the project's payback term is much less than the project's life, the algebraic sign of the net present value is unknown, a justification for such uncertainty would be that the payback period is calculated without taking into consideration the influence of the discount rate, and net present value must be calculated using an appropriate discount rate.\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":1},{"columns":[{"text":"Since all cash flows are discounted, the net present value of the project would be positive if somehow the discounted payback period would be less than a project's life. Furthermore, because the discounted payback period is less than the project's life, the cash flows after the payback period would still result in a positive net present value.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":2}],"rating":0,"solutionUuid":"ec8bd3e2-fbf4-4ea5-a580-b62280c5f3e6","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":2}],"textbook":{"authors":"Bradford D. Jordan, Randolph W. Westerfield, Stephen A. Ross","imageUrl":"https://d2nchlq0f2u6vy.cloudfront.net/textbook_covers/tmpm0p82b7h","imageThumbnailUrl":"https://d2nchlq0f2u6vy.cloudfront.net/cache/d1/d3/d1d34d106dd29dd2e71be582412ef59d.jpg","id":34320,"isbn":"9781259918957","isPremium":true,"title":"Fundamentals of Corporate Finance","edition":"12th Edition","verifiedSolutionCount":1217,"shouldBeIndexableForSeo":true,"modified":1665448474394,"active":true,"publisher":"McGraw-Hill Education","mainTextbookIsbn":null,"subjects":{"level1":["Social Science"],"level2":["Economics"],"level3":["Finance"]}},"nextExercises":[{"id":14881173,"exerciseName":"2","page":303,"hasSolution":true,"mediaExerciseId":"634f0509-548b-40ac-b6b1-578e3ed917f9","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-9-critical-thinking-questions-2-634f0509-548b-40ac-b6b1-578e3ed917f9"},{"id":14881174,"exerciseName":"3","page":303,"hasSolution":true,"mediaExerciseId":"a20b441c-04f0-494c-913e-ef1806f05cb4","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-9-critical-thinking-questions-3-a20b441c-04f0-494c-913e-ef1806f05cb4"}],"previousExercises":[{"id":14881171,"exerciseName":"7","page":300,"hasSolution":true,"mediaExerciseId":"806c2965-3470-4d12-8b61-598355549923","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-9-critical-thinking-questions-7-806c2965-3470-4d12-8b61-598355549923"}],"_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-9-critical-thinking-questions-1-27e36e1e-319a-4c3a-9866-ff48f9552769"}