{"id":14881100,"mediaExerciseId":"6c5220cb-58c4-40da-b9d0-dab2c3d0b9db","exerciseName":"2","chapterName":"8","chapterTitle":"Stock Valuation","groupId":null,"groupTitle":null,"isPremium":true,"sectionName":"8.2","sectionTitle":"Some Features of Common and Preferred Stocks","pageNumber":255,"solutions":[{"id":6384301,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"8.2a\n-\nIn this part of the question, we are asked to define the meaning of a proxy.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":1},{"columns":[{"text":"A **proxy** is a permitted operative who serves on behalf of another person. A stock proxy is a broad true representation of the stock market, which thus enables businesses to consider voting without physiologically attending the average yearly investor's conference. \n\nExperts gather a bunch of stock markets in some kind of a single category and merge one‘s accomplishments to create a benchmark, also known as a proxy, for those stocks. The proxy functions similarly to a temperature probe, assessing the wellbeing of the branches of the company. A proxy would be someone titled \"to make a big decision for you unless you are unable to.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"8.2b\n-\n In this question we are asked to show what right does stockholders hold from a business.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":3},{"columns":[{"text":"The conceptual shape of the business enterprise assumes that shareholders go with administrators who, in turn, rent managers to perform their directives. Shareholders, therefore, manipulate the business enterprise via the proper to go with the administrators. Generally, simplest shareholders have this proper. \n\nDirectors are elected every 12 months at an annual assembly. Although there are exceptions that were mentioned next, the overall concept is “one share, one vote” (now no longer one shareholder, one vote). Corporate democracy is thus very exclusive from our political democracy. With company democracy, the “golden rule” prevails absolutely. \n\nDirectors are elected at an annual shareholder` assembly via way of means of a vote of the holders of a majority of stocks who're gift and entitled to vote. However, the precise mechanism for electing administrators differs throughout companies. The maximum critical distinction is whether or not stocks have to be voted cumulatively or voted straight.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4},{"columns":[{"text":"8.2c \n-\nIn this question, we are asked why a preferred stock is being called preferred.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":5},{"columns":[{"text":"**Preferred shares** are so named since they provide one ‘s owners with a first-class assertion only when a firm earns dividend income or allocates holdings to stockholders. Asset backed stock option are preferred shares that can be paid back by the lender at a predetermined price before even the settlement date. \n\nBorrowers use this form of preference shares for funding that they like this same convenience of being able to recoup everything. Businesses are permitted to enter and also have an anticipation of demand over ordinary shares upon that business's profitability.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":6}],"rating":0,"solutionUuid":"7695432a-8871-46c1-bbb0-ef235b6a0f3e","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":6},{"id":6045463,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"$a)$ During a company's annual conference, shareholders might vote on even a variety of proposals, even when a shareholder is unable to attend the conference, he could assign her voting rights to some other person or entity by completing the necessary legal documents is known as a proxy.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":1},{"columns":[{"text":"$b)$ Let‘s see the rights of stockholders does have below:\n\n$i)$ A stockholders also have the fundamental right to be involved in the company's prosperity through dividends and share price appreciation.\n\n$ii)$ Once all creditors and bondholders have been paid, a stockholder always had the right to collect their share of the assets if the firm is dissolved.\n\n$iii)$ A stockholders could have an impact somewhat on the company's operations via voting on resolutions at conferences.\n\n$iv)$ A company's stockholders already have the option to purchase more shares, while in event of a new problem. Existing shareholders are provided priority.\n\n$v)$ Throughout the event of a violation of rights, stockholders always had the right to sue the corporation or any related entity.\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"$c)$ A preferred stockholders receive first rights on corporate pay-outs, which seem to be typically higher and fixed than regular dividends, preferred dividends can likewise be paid first through retained earnings and have a greater priority than common dividends.\n\nThe preferred investors were often granted preference above regular stockholders in terms of asset distribution in the event of such a company's dissolution.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3}],"rating":0,"solutionUuid":"c811129d-5ec4-4342-baa7-58314c6ce385","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":3}],"textbook":{"authors":"Bradford D. Jordan, Randolph W. Westerfield, Stephen A. Ross","imageUrl":"https://d2nchlq0f2u6vy.cloudfront.net/textbook_covers/tmpm0p82b7h","imageThumbnailUrl":"https://d2nchlq0f2u6vy.cloudfront.net/cache/d1/d3/d1d34d106dd29dd2e71be582412ef59d.jpg","id":34320,"isbn":"9781259918957","isPremium":true,"title":"Fundamentals of Corporate Finance","edition":"12th Edition","verifiedSolutionCount":1217,"shouldBeIndexableForSeo":true,"modified":1665448474394,"active":true,"publisher":"McGraw-Hill Education","mainTextbookIsbn":null,"subjects":{"level1":["Social Science"],"level2":["Economics"],"level3":["Finance"]}},"nextExercises":[{"id":14881105,"exerciseName":"3","page":262,"hasSolution":true,"mediaExerciseId":"5edbda84-924e-4486-bfb2-d058537f5141","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-8-exercises-3-5edbda84-924e-4486-bfb2-d058537f5141"}],"previousExercises":[{"id":14881099,"exerciseName":"1","page":250,"hasSolution":true,"mediaExerciseId":"78de15ce-cfb4-49d2-b8b7-b695c709a23f","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-8-exercises-1-78de15ce-cfb4-49d2-b8b7-b695c709a23f"}],"_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-8-exercises-2-6c5220cb-58c4-40da-b9d0-dab2c3d0b9db"}