{"id":14880832,"mediaExerciseId":"7bce67fd-fd1f-43bd-ad05-681a0eecc629","exerciseName":"2","chapterName":"4","chapterTitle":"Long-Term Financial Planning and Growth","groupId":null,"groupTitle":null,"isPremium":true,"sectionName":"4.2","sectionTitle":"Financial Planning Models: A First Look","pageNumber":98,"solutions":[{"id":5920991,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"In this exercise, we are to determine the (a) components of a financial plan and (b) determine the importance of a plug in a financial planning model","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":1},{"columns":[{"text":"## Financial Planning\n\\\nFinancial planning is referred to as the systematic method of the attainment of the company's financial goals. It indicates the actions and decisions to be done in the future for the company.\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"## Required (a)\n\\\nNow, let us determine the basic components of a financial plan.\n\\\nThe components of a financial plan are as follows:\n&nbsp;\n* Sales Forecast\n&nbsp;\n* Pro Forma Statements\n&nbsp;\n* Asset Requirements\n&nbsp; \n* Financial Requirements","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3},{"columns":[{"text":"## Sales Forecast\n\\\nA sales forecast estimates the revenue for the next period of operations of a company. The sales forecast- the projected sales and financing- for a financial plan is done externally on which the planning will be based.\n\\\nThe estimation is usually in revenue percentage growth than in numerical sales figures. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4},{"columns":[{"text":"## Pro Forma Statements\n\\\nPro Forma statements include a forecasted balance sheet, an income statement, and a statement of cash flows. These financial statements are necessary for the determination of the summary of projected events in the succeeding years of operation of the firm.\n\\\nThe pro forma statements are considered outputs of the financial plan. The management would estimate the projected and would then produce the pro forma statements.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":5},{"columns":[{"text":"## Asset Requirements\n\\\nFinancial planning would require a capital budget that will be consisted of the changes in the total fixed assets and the working capital of the company. This budget will be allocated to the capital spending of the financial plan. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":6},{"columns":[{"text":"## Financial Requirements\n\\\nThe financial requirements would include the financing options of the company including the dividend and debt policy. At the same time, this part of the financial plan would include the kinds of securities that the company has to sell and the issuance methods of these securities. ","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":7},{"columns":[{"text":"## Required (b)\n\\\nNow, let us determine the reasons why it is necessary to designate a plug in a financial planning model.\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":8},{"columns":[{"text":"After the determination of the projected sales forecast and the estimation of the capital spending, there might be a surplus in the projected assets over the liabilities and equity. Consequently, the balance sheet amounts will not be balanced. \n\\\nA financial plug will be necessary since a new financing option will be used to finance the plans. A financial plug variable, simply a **plug**, served as a source for the external financing necessary to cover the shortages or surplus in the financing that will consequently balance out the amounts in the balance sheet.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":9}],"rating":5,"solutionUuid":"448b88cc-8b0d-4770-a4e2-8540b48af222","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":9},{"id":5926144,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"The exercise will require us to (1) determine the essential components of a financial plan and (2) understand why it is necessary to designate a plug for a financial planning model.\n\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":1},{"columns":[{"text":"## Requirement 1. \n\n### The essential components of the financial planning model.\n\nThe financial planning model differs from one firm to another firm as each company is unique on its own. Models may vary from one to another, but all are essential common elements.\n\n1. Sales Forecast.\n\n2. Pro Forma Statements.\n3. Asset Requirement.\n4. Financial Requirements.\n","images":{"latex":{"large":{"height":66,"srcUrl":"https://d2nchlq0f2u6vy.cloudfront.net/21/12/23/ed9e7af092b17bc8aa0ef7685a0084e4/76a66599253447a6f8e1d021db9ecaba/lateximg_large.png","width":995},"regular":{"height":34,"srcUrl":"https://d2nchlq0f2u6vy.cloudfront.net/21/12/23/ed9e7af092b17bc8aa0ef7685a0084e4/76a66599253447a6f8e1d021db9ecaba/lateximg.png","width":498}},"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"### Briefly describe the sales forecast.\n\n**Sales forecast** - The sales forecast refers to the projected future sales of the financial planning; the forecast is used to calculate the possible income of the company.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3},{"columns":[{"text":"### Second, describe what pro forma statements are.\n\n**Pro Forma Statements** - The pro forma statements are the projected financial statements of the company, such as the statement of financial position, statement of comprehensive income, and cash flow statement. The pro format statements are prepared to visualize the possible outcome of the new financial planning model. The reports are based on the projected necessary items like forecasted sales.\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4},{"columns":[{"text":"### Next, explain the asset requirement.\n\n**Asset requirement** - The new financial planning model will require further capital spending, shown in the projected balance sheet. The projected balance sheet should include the possible changes in fixed assets. The asset requirements list the potential assets for the new model.\n\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":5},{"columns":[{"text":"### Last,  describe the financial requirements.\n\n**FInancial requirements** - The new financial planning will require an extensive financing arrangement to support the model. The financial condition focuses on the possible cash inflow, how to raise cash by selling new shares or creating stock options, and methods to secure more funding.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":6},{"columns":[{"text":"## Requirement 2.\n\n### Why is there a need to designate a plug in financial planning?\n\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":7},{"columns":[{"text":"### First, let us discuss what is plug in a financial planning model.\n\nFinancial planning will result in possible new financing of the business, and this potential new financing should cover all the projected capital spending, possible expenses in the future. \n\nThe plug is the possible designated source or source of external financing that a company can use to deal with any future shortage and surplus due to new financing.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":8},{"columns":[{"text":"### Discuss why it is necessary to designate a plug for a financial planning model.\n\nDesignating a financial plug is used to ensure that the company can sustain the new financial planning model. The designation of the plug is the company's safety net that in case there is a shortage, there will be an external resource that they can get to sustain the new model.\n\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":9}],"rating":5,"solutionUuid":"aeb649f2-540c-4844-b147-4fdc3c750e7d","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":9},{"id":6327105,"modifiedOn":"2021-01-01T00:00:00.000000","steps":[{"columns":[{"text":"In this exercise, we are requested to identify the most important components of a financial plan and to explain why identifying a plug in a financial planning model is necessary.\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":true}],"isResult":false,"stepNumber":1},{"columns":[{"text":"a) We have the five most important components of a financial plan, which are:\n\n**Sales Forecast:** Almost all financial plans call on an estimate of sales from a third party. Sales forecasts are a good example of a \"driver,\" as this number is entered directly into the planning model by the user and is used to determine all other variables. This is a standard structure for many different sorts of businesses; planning will concentrate on predicted future sales as well as the assets and funding required to support those sales.\n\n","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":2},{"columns":[{"text":"**Pro Forma Statements:** When creating a financial plan, it is important to include the balance sheet, income statement, and statement of cash flows predicted. Pro forma statements, or pro forms for short, are a kind of financial statement. Therefore, financial statements are the format that we use to summarize the many events that are predicted to take place in the future.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":3},{"columns":[{"text":"**Asset Requirements:** The plan will include details on planned capital expenditures. Net working capital and total fixed assets must be included in the anticipated balance sheet. We might say that these adjustments represent the whole capital budget for the business.  In order to stay on track with the long-term plan's overall growth, proposed capital expenditures in various sectors must be balanced.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":4},{"columns":[{"text":"**Financial Requirements:** An whole component of the strategy will be devoted to making the required financial arrangements. The dividend policy and debt policy should be discussed in this section of the plan. The sale of new shares of stock or the borrowing of money is two common ways that companies hope to obtain more funds. This means that the strategy will have to evaluate what types of securities will need to be sold as well as what techniques of issuance would be most suitable in this situation.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":5},{"columns":[{"text":"**The Plug:** To bring the company's balance sheet into balance, the plug is the defined source or source of external funding that is required to cope with any shortcomings in financing.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":6},{"columns":[{"text":"**Economic Assumptions:** The economic environment in which the business intends to be located over the plan's lifespan must be stated expressly in the plan. It is vital to make assumptions about interest rates and corporate tax rates while developing a business plan.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":7},{"columns":[{"text":"b) When a company's planned sales and estimated asset expenditures exceed its forecast total liabilities and equity, it often needs extra financing, therefore identifying a **plug in** a financial planning model is a must. To put it another way, the balance sheet will no longer be equal to zero. \n\nBecause it is possible that extra financing may be needed to cover all of the expected capital expenditures, a financial \"plug\" variable must be stated in the financial model. It is the designated source or sources of external funds that are required to cope with any shortfall in financing and, as a result, to put the balance sheet back into balance.","images":{"latex":null,"additional":null},"hasInvalidKatex":false,"isTextOnly":false}],"isResult":false,"stepNumber":8}],"rating":0,"solutionUuid":"9025035a-c7c6-48ba-a546-df27a9174e2d","editorVersion":2,"answeredOn":null,"ratingCount":null,"solutionOrder":null,"totalSteps":8}],"textbook":{"authors":"Bradford D. Jordan, Randolph W. Westerfield, Stephen A. Ross","imageUrl":"https://d2nchlq0f2u6vy.cloudfront.net/textbook_covers/tmpm0p82b7h","imageThumbnailUrl":"https://d2nchlq0f2u6vy.cloudfront.net/cache/d1/d3/d1d34d106dd29dd2e71be582412ef59d.jpg","id":34320,"isbn":"9781259918957","isPremium":true,"title":"Fundamentals of Corporate Finance","edition":"12th Edition","verifiedSolutionCount":1217,"shouldBeIndexableForSeo":true,"modified":1665448474394,"active":true,"publisher":"McGraw-Hill Education","mainTextbookIsbn":null,"subjects":{"level1":["Social Science"],"level2":["Economics"],"level3":["Finance"]}},"nextExercises":[{"id":14880833,"exerciseName":"3","page":103,"hasSolution":true,"mediaExerciseId":"0f69fd5b-6551-4c53-a72f-6f3f496635eb","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-4-exercises-3-0f69fd5b-6551-4c53-a72f-6f3f496635eb"}],"previousExercises":[{"id":14880831,"exerciseName":"1","page":95,"hasSolution":true,"mediaExerciseId":"3da3081f-855f-46c9-89dd-645b7a01ca52","_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-4-exercises-1-3da3081f-855f-46c9-89dd-645b7a01ca52"}],"_webUrl":"https://quizlet.com/explanations/textbook-solutions/fundamentals-of-corporate-finance-12th-edition-9781259918957/chapter-4-exercises-2-7bce67fd-fd1f-43bd-ad05-681a0eecc629"}